testsuite_results/sysbench/results/oltp_insert.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 7584.33 qps: 7584.33 (r/w/o: 0.00/7584.33/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 7723.97 qps: 7723.97 (r/w/o: 0.00/7723.97/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 7639.80 qps: 7639.80 (r/w/o: 0.00/7639.80/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           462268
        other:                           0
        total:                           462268
    transactions:                        462268 (7700.94 per sec.)
    queries:                             462268 (7700.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      7700.9441
    time elapsed:                        60.0286s
    total number of events:              462268

Latency (ms):
         min:                                    3.51
         avg:                                   16.61
         max:                                   60.44
         95th percentile:                       20.74
         sum:                              7679976.88

Threads fairness:
    events (avg/stddev):           3611.4688/14.41
    execution time (avg/stddev):   59.9998/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 7786.45 qps: 7786.45 (r/w/o: 0.00/7786.45/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 7974.80 qps: 7974.80 (r/w/o: 0.00/7974.80/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 8032.77 qps: 8032.77 (r/w/o: 0.00/8032.77/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           476573
        other:                           0
        total:                           476573
    transactions:                        476573 (7940.43 per sec.)
    queries:                             476573 (7940.43 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      7940.4276
    time elapsed:                        60.0196s
    total number of events:              476573

Latency (ms):
         min:                                    3.72
         avg:                                   16.11
         max:                                   57.05
         95th percentile:                       20.00
         sum:                              7679762.22

Threads fairness:
    events (avg/stddev):           3723.2266/27.67
    execution time (avg/stddev):   59.9981/0.00